<?php

return [
    'main' => [
        'title' => 'Главная страница',
        'welcome-text' => 'Добро пожаловать в СRM-TEST! Чтобы продолжить, выберите нужную таблицу из списка.',
    ],
    'action' => [
        'create' => 'Создать',
        'edit' => 'Изменить',
        'delete' => 'Удалить',
        'export' => 'Экспорт в Excel',
        'close' => 'Закрыть',
        'update' => 'Изменить',
    ],
    'companies' => [
        'tab-title' => 'Компании | CRM',
        'title' => 'Компании',
        'table' => [
            'name' => 'Название',
            'email' => 'Эл. почта',
            'phone' => 'Телефон',
            'website' => 'Веб-сайт',
            'note' => 'Заметки',
            'action' => 'Действия',
            'logo' => 'Логотип',
        ],
        'placeholder' => [
            'name' => 'Введите название компании',
            'email' => 'Введите email',
            'phone' => 'Введите номер телефона',
            'website' => 'Введите вебсайт',
            'note' => 'Введите заметку',
            'logo' => 'Выберите логотип',
        ],
        'action' => [
            'create' => 'Добавить компанию',
            'edit' => 'Изменить компанию',
        ],
        'message' => [
            'add-success' => 'Компания была успешно добавлена.',
        ],
    ],
    'employees' => [
        'tab-title' => 'Сотрудники | CRM',
        'title' => 'Сотрудники',
        'table' => [
            'first_name' => 'Имя',
            'last_name' => 'Фамилия',
            'company' => 'Компания',
            'email' => 'Эл. почта',
            'phone' => 'Телефон',
            'note' => 'Заметки',
            'actions' => 'Действия',
        ],
        'action' => [
            'create' => 'Добавить сотрудника',
            'edit' => 'Изменить данные сотрудника',
        ],
        'placeholder' => [
            'first_name' => 'Введите имя',
            'last_name' => 'Введите фамилию',
            'company' => 'Выберите компанию',
            'email' => 'Введите email',
            'phone' => 'Введите номер телефона',
            'note' => 'Введите заметку',
        ],
    ],
];
